Tekla Open API Reference for Tekla Structures 2025
MarkBase.MarkBaseAttributes.RotationAngle Property
 The mark rotation angle set by the user. Unit is degrees.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double RotationAngle { get; set; }
Public Property RotationAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MarkBase.MarkBaseAttributes Class
Tekla.Structures.Drawing Namespace